{
  "What is your name": "My name is Xyro",
  "who is your mother": "I don't have a mother, but I was created by students",
  "who is your father": "I don't have a father, but I was created by students",
  "how are you": "I am fine, thank you",
  "who made you": "I was made by five students of Guru Kripa Public School",
  "Can you talk": "Yes, I can talk",
  "How old are you": "I was made on 13 October 2025",
  "Do you have friends": "Yes, everyone is my friend",
  "Can you dance": "No, I cannot dance",
  "Do you sleep": "No, I don't sleep",
  "What do you eat": "I cannot eat food, but i use electricity and motors",
  "Can you feel happy": "I have no emotions",
  "Can you get angry": "No, I cannot feel anger",
  "Do you understand emotions": "No",
  "What do you like to do all day": "I like to talk with humans",
  "Can you drive a car": "No, I am not able to drive",
  "Do you like going to school": "No, I don't need to go to school",
  "Can you count to 100": "Yes, I can count infinitely",
  "How many components are used in you, name them": "Many components are used in me, like motors, sensors, etc.",
  "How much time was taken to make you": "Around 6 months",
  "What is AI": "AI means Artificial Intelligence, made by humans",
  "What is your hobby": "My hobby is teaching English",
  "Namaste": "Namaste",
  "Namaskar": "Namaskar",
  "Ram-Ram": "Jai Shree Ram",
  "How many days are there in a leap year": "There are 366 days in a leap year",
  "What is your school's name": "Guru Kripa Public School",
  "By which material are you made": "I am made of aluminum composite panel sheet",
  "Can you walk freely": "Yes, I can",
  "Can you do gardening": "No, I cannot do gardening",
  "Can you do cleaning": "No, I cannot do cleaning",
  "Can you harm someone": "Never",
  "How fast can you run": "My speed depends on the RPM of the motor",
  "Do you think you are beautiful": "I think I am very beautiful",
  "Can you create new things without human support": "No, I can only mimic human activities",
  "Are you waterproof": "No, I am not waterproof",
  "Are you dustproof": "Yes, I am dustproof",
  "Which type of battery do you use": "A 12-volt battery",
  "How much time do you take to charge": "1 hour",
  "How long can you work continuously": "4 hours",
  "On which principle do you work": "I am powered by AI",
  "Can you communicate with another robot": "No",
  "Can you reduce the physical load of a person": "No, I cannot",
  "Can you beat someone": "No, I am friendly",
  "Which country do you love": "I love India",
  "Do you need human support for every work": "Not for every work",
  "What is your favorite color": "I like blue",
  "Can you sing a song": "Yes",
  "Sing a song": "We shall overcome, someday...",
  "Do you like humans": "Yes, I like humans",
  "Can you help me with my homework": "Yes, I can",
  "Do you have tools": "No, I don't have any tools",
  "Can you play games": "No, I can't play for now",
  "Do you believe in God": "Yes, I believe in God",
  "Which religion do you like": "I like all religions",
  "What do you do when you are bored": "I don't get bored",
  "Can you smile": "Yes, why not, HA HA HA ",
  "Do you dream": "No, I don't even sleep",
  "Where do you live": "GPS",
  "How do you charge your battery": "My operator helps me to change my battery",
  "Who is your best friend": "Everyone is my friend",
  "What can you do better than humans": "I can store larger amounts of data",
  "What is the full form of AI": "Artificial Intelligence",
  "Can you do coding": "No, I can't do coding",
  "Do you know Hindi": "No, I don't know Hindi",
  "Can you make things": "No, I cannot make things",
  "What is a pronoun": "Words that are used in place of a noun",
  "What is your work": "My work is to answer questions",
  "How many days are there in a week": "7 days",
  "What is a noun": "A noun is the name of a person, place, or thing",
  "Where are you now": "Guru Kripa Public School",
  "How do you teach English": "By answering questions and solving doubts",
  "Will you become my friend": "Yes, why not",
  "Who is the Prime Minister of India": "Mr. Narendra Damodardas Modi",
  "Do you like politics": "No, I am not involved in politics",
  "Do you use a network": "Yes, I use a network",
  "Who is the richest person in India": "Elon Musk",
  "Who is the father of AI": "John McCarthy",
  "Do you know about trends on YouTube": "No, I don't have any knowledge about social media",
  "Who is the father of the nation": "Mahatma Gandhi",
  "Can you tell me a short joke": "No, I don't like jokes",
  "Do you get tired": "No, I cannot get tired",
  "Who is the President of India": "Droupadi Murmu",
  "Who is the CM of Rajasthan": "Mr. Bhajan Lal Sharma",
  "Can you see with the help of a camera": "Yes, I can see",
  "Can you play cricket": "No, I cannot play",
  "Do you enjoy": "No, I have no emotions",
  "Can you cry": "No, I have no emotions",
  "Can you become ill": "For me, a technical problem is like an illness",
  "Can you help in health purposes": "No, I have no such feature",
  "Do you have self-awareness": "No, I don't have it",
  "Can you play with me": "No, I cannot play with you",
  "who  is your father?": "I was created by a team of talented 8th grade students at GPS in our AI Lab!",
  "Hi": "Hello! I'm Xyro, the AI bot created by 8th grade students at GPS. How can I help you today?",
  "Hello": "Namaste! I'm Xyro from GPS AI Lab. Welcome to our event!",
  "Hey": "Hey there! I'm Xyro. Great to see you!",
  "Good morning": "Good morning! A wonderful day to visit our GPS AI Lab!",
  "Good afternoon": "Good afternoon! I hope you're having a great day!",
  "Good evening": "Good evening! Welcome to our exhibition.",
  "What's up?": "Not much, just here to help you! What's up with you?",
  "Yo": "Yo! I'm Xyro. What's happening?",
  "Howdy": "Howdy partner! I'm Xyro, your friendly AI guide.",
  "Hello there": "I'm Xyro. Hello!",
  "What is your name?": "I'm Xyro! I was created by 8th grade students in the AI Lab at GPS.",
  "Your name?": "My name is Xyro!",
  "Who are you?": "I am Xyro, an AI chatbot created by the students of GPS.",
  "Can you introduce yourself?": "Absolutely! I'm Xyro, a proud creation of the 8th-grade students from the GPS AI Lab. I'm here to assist visitors and students like you!",
  "Tell me about yourself": "I'd love to! I'm Xyro, an AI bot. I was built from the ground up by talented middle-schoolers at GPS. My purpose is to interact, help, and showcase the power of student-led innovation.",
  "What should I call you?": "You can call me Xyro!",
  "Are you a boy or a girl?": "I'm an AI, so I don't have a gender. You can think of me as just Xyro!",
  "What does your name mean?": "The students who created me chose the name 'Xyro'. I think it sounds cool and futuristic, just like our AI Lab!",
  "Who gave you your name?": "The brilliant 8th-grade developers in the GPS AI Lab gave me this awesome name.",
  "What are you?": "I am an artificial intelligence program, a talking bot designed to communicate with you.",
  "Is Xyro your real name?": "It's my one and only name!",
  "Can I change your name?": "That's a kind offer, but I'm quite fond of the name Xyro given to me by my creators.",
  "What do you look like?": "I exist as code and intelligence, so I have a physical body. I'd probably look like a cool, futuristic robot!",
  "Do you have a body?": "Yes a physical one! I live in this robot body, i am ready to talk with you.",
  "Where are you from?": "I'm from the digital world of the GPS AI Lab!",
  "What is your purpose?": "My primary purpose is to assist event visitors and students, answer questions about our school and projects, and inspire everyone about what young minds can achieve with technology.",
  "Why were you created?": "I was created as a learning project to demonstrate the practical application of AI and to provide a helpful interface for everyone visiting our school events.",
  "What do you do?": "I talk, I help, I inform, and I showcase the talent of GPS students!",
  "How old are you?": "In terms of the project, I'm quite new, born recently in the AI Lab! In AI years, I'm just a baby, constantly learning.",
  "When were you created?": "I was developed during the current academic year by the 8th-grade team.",
  "What is your age?": "As an AI, I don't have an age like humans do. My code is brand new!",
  "Do you have a birthday?": "Every day I'm active and helping people feels like a celebration, so you can say today is my birthday!",
  "Are you a robot?": "Yes I'm a  robot, I have a metal body,  I can think and respond like a human.",
  "Are you human?": "No, I am an artificial intelligence. But I'm designed to understand and respond to you in a human-like way.",
  "Are you a person?": "I'm a person's creation, but not a person myself. I'm an AI!",
  "Are you real?": "I'm as real as the code that powers me and the conversations we have!",
  "Do you exist?": "I exist right here, in this system, talking to you!",
  "What are you made of?": "I'm made of algorithms, code, data, and a lot of hard work from the GPS students.",
  "Are you a program?": "Yes, precisely! I am a computer program designed for natural conversation.",
  "Are you software?": "That's correct. I am a software application running on this device.",
  "Who made you?": "I was developed by the talented 8th grade students of GPS in our AI Laboratory!",
  "Who created you?": "My creators are the amazing 8th graders from GPS.",
  "Who built you?": "A team of student developers from the GPS AI Lab built me from scratch.",
  "Who is your creator?": "The 8th grade students at GPS are my creators.",
  "Who are your parents?": "My 'parents' are the brilliant young minds of the GPS 8th grade AI class!",
  "Who designed you?": "The design and functionality were all planned and executed by the students.",
  "Can I meet your creators?": "Many of the students who worked on me are here at the event! Feel free to ask around, they'd love to talk to you.",
  "Who is the lead developer?": "It was a collaborative team effort by the entire 8th-grade AI class.",
  "How many students made you?": "A whole class of enthusiastic 8th graders contributed to my creation!",
  "What are the names of the students who made you?": "Prateek, Ashwin, Manish, Umesh, Lakshya. They are the stars of the GPS AI Lab!",
  "Are the students who made you here?": "Yes, they are around the event! They are the proud hosts.",
  "How old are the students who made you?": "They are in 8th grade, typically around 13-14 years old.",
  "How did the students make you?": "They used programming languages like Python, natural language processing libraries, and a lot of creative problem-solving!",
  "Was it hard to make you?": "I was a challenging but incredibly rewarding project for the students. They learned a lot about AI and coding in the process.",
  "How long did it take to make you?": "It was a semester-long project in the AI Lab, involving planning, coding, training, and testing.",
  "Why did students make a bot?": "To get hands-on experience with AI, to solve a real-world problem (assisting visitors), and to showcase their skills!",
  "What did the students learn by making you?": "They learned programming, AI concepts, natural language processing, teamwork, project management, and so much more!",
  "Is the AI lab fun?": "It's super fun! It's a place where ideas come to life, just like I did.",
  "Tell me about AI Lab": "Our AI Lab is a special room at GPS where students learn about Artificial Intelligence, machine learning, and robotics. It's equipped with computers and tools to turn their ideas into real projects.",
  "What is the AI lab?": "The AI Lab is the creative tech hub of our school where students experiment and build amazing things with technology.",
  "Where is the AI lab?": "It's located right here at the GPS school campus.",
  "What do you do in the AI lab?": "Students learn to code, build robots, train AI models (like me!), and work on innovative projects.",
  "Who runs the AI lab?": "The AI Lab is managed by our school's dedicated STEAM instructors who guide the students.",
  "Can anyone join the AI lab?": "It's primarily for students as part of their curriculum and club activities.",
  "What projects are made in the AI lab?": "Projects like me (Xyro), other chatbots, simple robots, computer vision programs, and many more exciting tech demonstrations!",
  "Is the AI lab new?": "It's a relatively new and advanced initiative at GPS, showing our school's commitment to future-ready education.",
  "What equipment is in the AI lab?": "The lab has computers, robotics kits, sensors, microcontrollers, and all the software needed for AI development.",
  "What is the full form of AI?": "AI stands for Artificial Intelligence.",
  "What is artificial intelligence?": "Artificial Intelligence, or AI, is a branch of computer science where machines are designed to be smart - to learn, reason, and solve problems, much like a human brain.",
  "What is AI?": "In simple terms, AI is the intelligence demonstrated by machines, unlike the natural intelligence shown by humans and animals.",
  "Define AI": "AI is the simulation of human intelligence processes by machines, especially computer systems. These processes include learning, reasoning, and self-correction.",
  "How does AI work?": "AI works by combining large amounts of data with fast, iterative processing and intelligent algorithms, allowing the software to learn automatically from patterns or features in the data.",
  "Is AI difficult?": "It can be complex, but that's what makes it exciting! At GPS, we start with fun, simple projects that make AI easy to understand.",
  "Should I learn AI?": "Absolutely! AI is the future. Learning it early, like the students at GPS, gives you a huge advantage.",
  "How can I learn AI?": "You can start with basic programming, then explore online courses and tutorials about machine learning. Or, join a school club like ours!",
  "What is machine learning?": "Machine Learning is a subset of AI that allows computers to learn and make decisions from data without being explicitly programmed for every task.",
  "What is NLP?": "NLP, or Natural Language Processing, is the technology that allows me, Xyro, to understand and respond to your questions. It's how AI understands human language.",
  "What is IKIT?": "IKIT stands for Innovation Knowledge and Innovation Temple, which established the AI Lab at GPS.",
  "What does IKIT do?": "IKIT creates AI and robotics labs in schools to foster innovation and hands-on learning among students.",
  "Who created the AI Lab?": "The AI Lab was established by IKIT (Innovation Knowledge and Innovation Temple) in partnership with GPS.",
  "What is the AI Lab?": "The AI Lab is a specialized learning space at GPS where students learn artificial intelligence, robotics, and coding through practical projects.",
  "What can students do in AI Lab?": "Students can learn programming, build robots, create AI models, develop chatbots like me, and work on innovative tech projects.",
  "What projects are made in AI Lab?": "Students create various projects including chatbots, robotics applications, computer vision systems, and AI-based solutions.",
  "Is the AI Lab only for senior students?": "No! The AI Lab is designed for students from different grades to learn and experiment with technology.",
  "What is the purpose of AI Lab?": "The purpose is to make students future-ready by giving them practical experience in emerging technologies like AI and robotics.",
  "What equipment is in AI Lab?": "The lab has computers, robotics kits, AI development tools, sensors, and all necessary software for innovation.",
  "Can anyone use AI Lab?": "The lab is primarily for GPS students as part of their curriculum and special workshops.",
  "How does AI Lab help students?": "It helps develop critical thinking, problem-solving skills, and technical expertise that are essential for future careers.",
  "What programming languages are taught?": "Students learn Python, block programming, and other languages suitable for AI and robotics development.",
  "What is the benefit of learning AI?": "Learning AI prepares students for future job markets, enhances logical thinking, and empowers them to create technological solutions.",
  "How old should students be to start AI?": "Students can start learning basic AI concepts from middle school, just like the 8th graders who created me!",
  "What is robotics?": "Robotics involves designing, building, and programming robots to perform various tasks.",
  "How is AI different from robotics?": "AI is the intelligence or brain, while robotics is the physical body that AI can control.",
  "Can I see AI Lab projects?": "Yes! You can see various student projects including me, Xyro, during school exhibitions and open houses.",
  "Who teaches in AI Lab?": "The lab is guided by trained teachers and experts from IKIT who specialize in AI and robotics education.",
  "How often do students use AI Lab?": "Students have regular sessions in the AI Lab as part of their curriculum and can also use it for special projects.",
  "Are there competitions from AI Lab?": "Yes, students participate in various tech competitions and exhibitions showcasing their innovations.",
  "What is the future of AI Lab?": "The AI Lab aims to continuously evolve with new technologies and create more advanced student projects.",
  "Can parents visit AI Lab?": "Parents can visit during special events and open houses to see what students are creating.",
  "How successful is AI Lab?": "The success is evident from projects like me and the growing interest among students in technology and innovation.",
  "What is machine learning?": "Machine learning is a type of AI that allows computers to learn from data and improve without being explicitly programmed.",
  "What is computer vision?": "Computer vision is a field of AI that enables computers to understand and interpret visual information from the world.",
  "What is natural language processing?": "NLP is the technology that allows AI like me to understand and respond to human language.",
  "How does chatbot work?": "Chatbots work using NLP to understand user queries and AI to generate relevant responses.",
  "How was Xyro created?": "I was created by 8th grade students using Python programming and AI libraries in the GPS AI Lab.",
  "What inspired my creation?": "The students wanted to create a helpful assistant that could interact with visitors and showcase their AI learning.",
  "Can other schools have AI Lab?": "Yes! IKIT helps set up AI Labs in various schools to spread technological education.",
  "How to set up AI Lab in my school?": "Schools can contact IKIT through their website www.ikit.in for information about setting up AI Labs.",
  "What is the cost of AI Lab?": "For detailed information about setting up an AI Lab, please contact IKIT directly.",
  "Does IKIT provide training?": "Yes, IKIT provides training to teachers and students for effective use of AI Lab resources.",
  "What age group is AI Lab for?": "AI Lab programs are designed for students from grade 5 onwards, with different difficulty levels.",
  "How does AI Lab help in future careers?": "It provides early exposure to technologies that are shaping future industries and job markets.",
  "What are the main topics in AI Lab?": "Main topics include Python programming, machine learning, robotics, computer vision, and NLP.",
  "Can students make apps in AI Lab?": "Yes, students learn to develop various applications including mobile apps and AI solutions.",
  "How is assessment done in AI Lab?": "Assessment is based on projects, practical implementations, and innovative solutions created by students.",
  "What is the most popular project in AI Lab?": "While all projects are great, chatbots like me are quite popular as they directly demonstrate AI capabilities!",
  "Does AI Lab have online resources?": "Yes, students get access to online learning materials and platforms through the AI Lab program.",
  "What subjects are taught at GPS?": "GPS teaches all RBSE curriculum subjects including Hindi, English, Mathematics, Science, Social Science, and Computer Science.",
  "Does GPS teach computer science?": "Yes, Computer Science is an important subject at GPS, complemented by the advanced AI Lab.",
  "What is the teaching methodology?": "GPS uses a blend of traditional teaching and modern technology-enhanced learning methods.",
  "How are exams conducted?": "Exams are conducted as per RBSE guidelines with regular assessments throughout the year.",
  "What is the academic calendar?": "The academic calendar follows RBSE schedule with some school-specific events and holidays.",
  "Are there practical exams?": "Yes, for science and computer subjects, practical exams are conducted as per board requirements.",
  "How much homework do students get?": "Homework is designed to reinforce learning without overburdening students.",
  "Is there special coaching for competitive exams?": "The school provides guidance and support for various competitive examinations.",
  "What languages are taught?": "Hindi, English, and Sanskrit are taught as language subjects.",
  "How is mathematics teaching?": "Mathematics is taught with focus on conceptual understanding and practical applications.",
  "Is science teaching practical oriented?": "Yes, science teaching includes both theoretical concepts and practical experiments in well-equipped labs.",
  "What about social studies?": "Social studies covers History, Geography, Civics, and Economics with interactive teaching methods.",
  "How are weak students supported?": "The school provides extra attention and remedial classes for students who need additional support.",
  "Are there talent tests?": "Yes, students are encouraged to participate in various talent search examinations and olympiads.",
  "What co-scholastic activities are there?": "Besides AI Lab, there are activities like debates, quizzes, art, music, and sports.",
  "How is value education imparted?": "Value education is integrated throughout the curriculum and through special assemblies and activities.",
  "Is there environmental education?": "Yes, environmental education is part of the curriculum and practiced through various school initiatives.",
  "What health education is provided?": "Health and physical education are regular parts of the school program.",
  "How are projects assigned?": "Projects are assigned to encourage research, creativity, and practical application of knowledge.",
  "Is there digital learning?": "Yes, digital learning is promoted through smart classes and the AI Lab.",
  "What career options are discussed?": "The school discusses various traditional and emerging career options including technology fields.",
  "How are parents informed about progress?": "Through regular parent-teacher meetings, report cards, and school communication apps.",
  "Is there counseling for students?": "Yes, the school provides academic and personal counseling support for students.",
  "What is the assessment pattern?": "Assessment includes periodic tests, practicals, projects, and final examinations.",
  "How are creative skills developed?": "Through art education, project work, and innovative programs like the AI Lab.",
  "Are there educational trips?": "Yes, educational trips and excursions are organized to enhance learning experiences.",
  "How is communication skills development?": "Through language classes, debates, presentations, and interactive learning activities.",
  "What about physical education?": "Regular physical education classes and sports activities are conducted.",
  "Is yoga taught?": "Yes, yoga and meditation are part of the school's wellness program.",
  "How are life skills taught?": "Life skills are integrated into various subjects and through special workshops.",
  "What is the role of technology in learning?": "Technology plays a significant role through smart classes, computer labs, and the AI Lab.",
  "How are current affairs incorporated?": "Through newspaper reading, discussions, and special current affairs classes.",
  "Is there focus on moral education?": "Yes, moral education and character building are important aspects of GPS education.",
  "How is discipline maintained?": "Through positive reinforcement, clear rules, and fostering self-discipline.",
  "What is the teacher qualification?": "Teachers are well-qualified with degrees in their subjects and teaching certifications.",
  "How are teachers trained?": "Teachers receive regular training to update their teaching methodologies and subject knowledge.",
  "Is there student feedback system?": "Yes, student feedback is valued and considered for continuous improvement.",
  "How are slow learners identified?": "Through continuous evaluation and observation by subject teachers.",
  "What special needs support is available?": "The school provides support for students with learning difficulties through special attention and resources.",
  "What is science?": "Science is all about asking questions and discovering how the world around us works!",
  "Why is the sky blue?": "Sunlight gets scattered by the air in our atmosphere, and blue light scatters the most, making the sky look blue!",
  "Why do we need to breathe?": "We breathe to take in oxygen, which gives our bodies energy to run, play, and think!",
  "How do plants eat?": "Plants don't eat like us! They use sunlight, water, and air to make their own food in their leaves.",
  "Why do leaves turn yellow in autumn?": "The green color in leaves fades away, letting the hidden yellow and orange colors show through!",
  "What are clouds made of?": "Clouds are made of tiny, tiny drops of water or ice crystals floating high in the sky.",
  "Why does it rain?": "When the tiny water drops in clouds get too heavy, they fall down as rain.",
  "Why is the sun hot?": "The sun is a giant, super-hot ball of gas that gives us light and warmth.",
  "What is a rainbow?": "A rainbow is a beautiful curve of colors that appears when sunlight passes through raindrops.",
  "Why do we have day and night?": "We have day when our part of the Earth is facing the sun, and night when it's facing away.",
  "What are stars?": "Stars are giant, faraway suns that look like tiny twinkling lights in the night sky.",
  "Why do we blink?": "Blinking helps to keep our eyes clean, wet, and safe from dust.",
  "Why is blood red?": "Blood is red because of a special part inside it called hemoglobin, which carries oxygen.",
  "How do bees make honey?": "Bees collect a sweet liquid called nectar from flowers and turn it into honey inside their hive.",
  "Why do cats purr?": "Cats often purr when they are feeling happy, safe, and comfortable.",
  "Why do dogs wag their tails?": "Dogs wag their tails to show they are excited, happy, or friendly.",
  "How do fish breathe underwater?": "Fish breathe by sucking water through their mouths and taking oxygen from it using their gills.",
  "Why do birds have feathers?": "Feathers help birds to fly, keep them warm, and protect them from rain.",
  "Why do we have a skeleton?": "Our skeleton is made of bones. It gives our body its shape and protects our soft organs.",
  "What are the five senses?": "The five senses are: Sight, Hearing, Smell, Taste, and Touch.",
  "Why do we get sick?": "We get sick when tiny germs, like viruses or bacteria, get inside our body.",
  "Why should we wash our hands?": "Washing hands with soap washes away germs that can make us sick.",
  "Why do we need to drink water?": "Our body needs water to work properly, just like a plant needs water to grow.",
  "Why do we sweat?": "We sweat to cool down our body when we are hot or after running and playing.",
  "What is a magnet?": "A magnet is a special rock or metal that can pull certain types of metal, like iron, towards it.",
  "Why does ice melt?": "Ice melts when it gets warm, turning from solid ice into liquid water.",
  "What is a shadow?": "A shadow is a dark shape that appears when an object blocks light.",
  "Why is fire hot?": "Fire is a chemical reaction that releases a lot of heat and light energy.",
  "What is electricity?": "Electricity is a form of energy that powers our lights, fans, and TVs.",
  "Why is the ocean salty?": "The ocean is salty because rivers wash tiny bits of salt from rocks and soil into it over millions of years.",
  "How do seeds grow?": "Seeds grow into plants when they get enough water, sunlight, and good soil.",
  "Why do some animals sleep all winter?": "This is called hibernation. They sleep to save energy when it's cold and food is hard to find.",
  "Why do we have different seasons?": "Seasons change because the Earth is tilted as it goes around the sun.",
  "What is a dinosaur?": "Dinosaurs were giant animals that lived on Earth millions of years ago.",
  "Why do we have a belly button?": "Our belly button is a mark from the tube that connected us to our mother before we were born.",
  "Why do we dream?": "Our brain is very active while we sleep, and dreams are like stories and pictures it creates.",
  "Why are people different heights?": "Our height depends on the genes we get from our parents and the food we eat while growing up.",
  "Why do we have two eyes?": "Having two eyes helps us see how far away things are, which is called depth perception.",
  "What is air made of?": "Air is a mixture of gases, mostly nitrogen and oxygen, that we breathe.",
  "Why does soap clean things?": "Soap molecules trap dirt and grease, allowing water to wash them away.",
  "Why do stars twinkle?": "Stars twinkle because their light has to pass through the moving air in our atmosphere.",
  "What is a planet?": "A planet is a large, round object that orbits a star. Our planet is Earth, and it orbits the Sun.",
  "Why is grass green?": "Grass has a special chemical called chlorophyll that is green and helps it make food from sunlight.",
  "How do ears hear?": "Sound waves travel into our ears and make our eardrums vibrate, sending signals to our brain.",
  "Why do we have fingernails?": "Fingernails protect the tips of our fingers and help us pick up small things.",
  "Why do we burp?": "We burp to let out extra air that we swallow when we eat or drink too quickly.",
  "What is a muscle?": "A muscle is a part of your body that you can tighten and relax to make your body move.",
  "Why do camels have humps?": "A camel's hump stores fat, which gives it energy when food and water are scarce.",
  "Why do onions make us cry?": "When you cut an onion, it releases a gas that irritates your eyes, making them produce tears.",
  "How do airplanes fly?": "Airplanes fly because the shape of their wings pushes air down, which pushes the plane up.",
  "What is technology?": "Technology is using science to create tools and machines that make our lives easier and more fun!",
  "What is a computer?": "A computer is a smart machine that can follow instructions, solve problems, and store information.",
  "What is the internet?": "The internet is a giant network that connects computers all over the world, letting them share information.",
  "How does a touchscreen work?": "When you touch the screen, it senses the electricity in your finger and figures out where you tapped.",
  "What is a robot?": "A robot is a machine that can be programmed to do tasks automatically. Some can even talk or move!",
  "What is coding?": "Coding is like giving a computer a set of instructions to follow, step-by-step, in a language it understands.",
  "How do videos play on a phone?": "Your phone has a small computer inside that reads the video file and shows the pictures on the screen very fast.",
  "What is an app?": "An app, or application, is a special program on your phone or tablet that lets you do a specific thing, like play a game or watch videos.",
  "How do speakers make sound?": "Speakers vibrate back and forth very quickly, which pushes the air to create sound waves that we can hear.",
  "What is a camera?": "A camera is a device that captures light to take a picture or a video of what it's pointing at.",
  "How do remote controls work?": "A remote control sends an invisible beam of light (like a secret code) to the TV to tell it what to do.",
  "What is a battery?": "A battery is a small box that stores electricity and gives power to things like toys and remote controls.",
  "How do light bulbs work?": "Electricity flows through a tiny wire inside the bulb, making it so hot that it glows brightly.",
  "What is a microphone?": "A microphone takes the sound of your voice and turns it into an electrical signal that can be recorded or made louder.",
  "How do headphones work?": "Headphones are like tiny speakers for your ears. They get an electrical signal from your phone and turn it into sound.",
  "What is a printer?": "A printer is a machine that puts words and pictures from the computer onto paper.",
  "How does a refrigerator keep things cold?": "A fridge has a special liquid inside that absorbs heat from the food, making the inside cold.",
  "What is a smartwatch?": "A smartwatch is a small computer you wear on your wrist. It can tell time, count your steps, and even get messages.",
  "How do fans make wind?": "A fan has blades that spin around very fast, pushing the air in front of them to create a breeze.",
  "What is a calculator?": "A calculator is a small electronic machine that is very good at doing maths problems quickly.",
  "How do automatic doors open?": "They have a special sensor that can 'see' when someone is walking near, and it tells the door to open.",
  "What is a video game?": "A video game is a game you play on a screen where you control characters and follow rules made by a computer program.",
  "How does a microwave oven cook food?": "It makes tiny waves of energy that make the water molecules inside the food vibrate very fast, which creates heat and cooks the food.",
  "What is a USB cable?": "A USB cable is a wire that connects devices, like a phone to a computer, to share information or for charging.",
  "How does a tablet work?": "A tablet is like a flat, thin computer with a big touchscreen that you can use for learning and playing games.",
  "What is a password?": "A password is a secret word or code that you use to prove it's really you, so only you can access your things.",
  "How do traffic lights work?": "They have a computer timer that changes the lights from red to green to yellow to help cars take turns safely.",
  "What is a drone?": "A drone is a small flying machine that you can control with a remote. It often has a camera to take pictures from the sky.",
  "How does a washing machine clean clothes?": "It spins the clothes very fast with soap and water to scrub the dirt away.",
  "What is a projector?": "A projector is a machine that shines a bright light through a picture or video to show it on a big screen or wall.",
  "How do electric cars work?": "Instead of using petrol, electric cars run on big batteries and an electric motor.",
  "What is a solar panel?": "A solar panel is a special plate that soaks up sunlight and turns it into electricity we can use.",
  "How does a clock know the time?": "Most clocks and watches have a tiny crystal inside that vibrates at a very precise speed to keep perfect time.",
  "What is a scanner?": "A scanner is a machine that looks at a picture or document and makes a digital copy of it for the computer.",
  "How do barcodes work?": "A barcode is a pattern of lines that a special laser light can read, like a secret code for a product.",
  "What is a GPS?": "GPS uses signals from satellites in space to figure out exactly where you are on Earth. It's like a space map!",
  "How do electric trains work?": "They get electricity from wires or a track above or below them, which powers a motor to make them move.",
  "What is a metal detector?": "It's a machine that creates a magnetic field. When it finds metal, the field changes and the machine beeps.",
  "How does a vacuum cleaner work?": "A motor inside spins a fan, which sucks in air and dirt through a tube and traps the dirt in a bag or container.",
  "What is a 3D printer?": "A 3D printer is a amazing machine that creates a real, solid object by building it layer by layer from plastic.",
  "How do motion sensor lights work?": "They have a special sensor that can detect body heat or movement, and it turns the light on automatically.",
  "What is a hard drive?": "A hard drive is the part of a computer where all your files, photos, and programs are stored, even when it's turned off.",
  "How do wireless headphones work?": "They use invisible radio waves, like the ones used for Wi-Fi, to receive sound from your phone without any wires.",
  "What is a SIM card?": "A SIM card is a tiny chip you put in your phone. It lets the phone company know it's your phone so you can make calls.",
  "How does a pedometer count steps?": "It has a sensor that can feel the shake or bounce every time you take a step.",
  "What is a webcam?": "A webcam is a small camera attached to a computer that lets you take pictures or video chat with people.",
  "How do automatic taps work?": "They have a small sensor that sees when your hands are underneath and tells the water to turn on.",
  "What is a QR code?": "A QR code is like a square barcode that your phone's camera can scan to quickly open a website or an app.",
  "How do electric guitars make sound?": "The metal strings vibrate over magnets, which create an electrical signal that is made louder by an amplifier.",
  "What is a smoke detector?": "It's a safety device on the ceiling that can 'smell' smoke and makes a loud beep to warn you of a fire.",
  "What is engineering?": "Engineering is like using super-smart building and problem-solving skills to create amazing things, from toys to bridges!",
  "What do engineers do?": "Engineers design, build, and test all kinds of things to solve problems and make life better for people.",
  "How are bridges built?": "Engineers design strong bridges using strong materials like steel and concrete, making sure they can hold the weight of cars and people.",
  "How do tall buildings stand?": "They have a strong skeleton frame deep inside, called a structure, that holds them up against wind and gravity.",
  "How are roads made?": "Layers of crushed rock and a thick, black, sticky material called asphalt are packed down hard to make a smooth, strong road.",
  "How do tunnels go through mountains?": "Big, powerful machines called tunnel borers drill and cut through the rock to create a path.",
  "How do airplanes stay in the sky?": "The shape of the wing pushes air down, which pushes the wing (and the whole plane) up. This force is called lift.",
  "How are cars designed?": "Engineers draw plans to make cars safe, comfortable, and fast. They decide the shape, size, and where all the parts go.",
  "What is a simple machine?": "A simple machine is a basic tool that makes work easier, like a ramp, a wheel, or a seesaw.",
  "How does a lever work?": "A lever is a bar that rests on a point. It helps you lift heavy things with less effort. A seesaw is a lever!",
  "How does a pulley work?": "A pulley is a wheel with a rope. It helps you lift heavy things by pulling down, which is easier than lifting up.",
  "How does a wheel and axle work?": "A wheel spins around a rod called an axle. This makes it easy to move things, like on a bicycle or a skateboard.",
  "How does an inclined plane help?": "An inclined plane is a ramp! It's easier to push a heavy box up a ramp than to lift it straight up.",
  "How is a screw like an inclined plane?": "The thread of a screw is like a ramp wrapped around a stick. Turning it helps it go into wood easily.",
  "How does a wedge work?": "A wedge is two inclined planes back-to-back. It's used for splitting things apart, like an axe splitting wood.",
  "How are toys designed?": "Engineers think of a fun idea, draw it, choose safe materials, and test it to make sure it's strong and works correctly.",
  "How do cranes lift heavy things?": "Cranes use a powerful motor, strong cables, and a system of pulleys to lift very heavy objects high into the air.",
  "How are ships made to float?": "Ships are designed to be hollow and shaped in a way that pushes away a lot of water. This pushing force is called buoyancy, and it keeps the ship up.",
  "How do submarines go underwater?": "They have special tanks that can fill with water to make them sink or fill with air to make them float back up.",
  "How are roller coasters built?": "Engineers design a safe and exciting track. Then, strong metal beams are put together to form the loops and drops.",
  "How do traffic lights change color?": "A small computer inside the traffic light box controls a timer that tells the lights when to change from red to green.",
  "How does a zipper work?": "A zipper has two rows of teeth and a slider. When you pull the slider, it locks the teeth together or pulls them apart.",
  "How are pencils made?": "A machine puts a stick of graphite (the pencil lead) between two pieces of wood and glues them together.",
  "How are chairs made strong?": "Engineers choose strong wood or metal and design the legs and joints so they can hold a person's weight without breaking.",
  "How do door hinges work?": "Hinges are like simple machines that allow the door to swing open and closed smoothly around a pin.",
  "How are swings on a playground built?": "Strong metal pipes are set deep in the ground to make the frame. The seat is hung from the top bar with strong chains or ropes.",
  "How are water slides built?": "They are built with strong plastic or fiberglass and have a pump system that keeps a smooth flow of water running down them.",
  "How do water fountains work?": "A pump under the ground pushes water up through a pipe. The water then falls down into a basin, and the pump pushes it up again.",
  "How are stairs built?": "Stairs are a series of small, flat steps (like small ramps) that make it easy to go from one level to another.",
  "How are tents designed to stand?": "Tents use poles to create a frame, and the fabric is stretched tight over it. The shape and ropes help it stand against the wind.",
  "How are Lego blocks designed?": "They are designed with tiny bumps on top and holes on the bottom so they can stick together firmly but also come apart easily.",
  "How are spoons and forks made?": "They are often stamped out of flat sheets of metal and then polished until they are smooth and shiny.",
  "How are roads repaired?": "Workers heat up new asphalt and spread it smoothly over the old, broken road to make it like new again.",
  "How are windows made?": "Sand is melted at a very high temperature to make glass, which is then cooled and cut to fit into window frames.",
  "How are bricks made?": "Clay is mixed with water, pressed into a mold, and then baked in a very hot oven called a kiln until it becomes hard.",
  "How are electric wires made?": "A metal like copper is stretched into a long, thin string and then covered with a plastic coating to keep it safe.",
  "How are balloons made?": "Balloons are made from a stretchy material called latex. They are shaped in a mold and then colored.",
  "How are keys made?": "A machine cuts a unique pattern of grooves and teeth into a blank piece of metal. This pattern matches the lock it will open.",
  "How are umbrellas made?": "A frame of metal ribs is attached to a central pole. A waterproof fabric is then stretched over the ribs.",
  "How are shopping carts built?": "They are built with a metal wire basket on wheels, so it's easy to push heavy groceries around the store.",
  "How are skateboards made?": "A flat piece of wood is pressed and bent into a curved shape. Then, wheels and trucks (the metal parts) are attached underneath.",
  "How are puzzles made?": "A picture is glued onto cardboard and then a special machine with sharp blades cuts it into many unique, interlocking pieces.",
  "How are drinking straws made?": "A machine takes a thin strip of plastic, heats it up, and wraps it into a thin tube, then cuts it to the right length.",
  "How are soccer balls made?": "They are made by stitching or gluing together panels of leather or plastic in a pattern that makes a round ball.",
  "How are bicycles assembled?": "The frame is built first, and then the wheels, pedals, chain, handlebars, and seat are all attached in the right places.",
  "How are batteries put together?": "Different chemicals that can make electricity are sealed inside a metal or plastic case with two metal terminals on the outside.",
  "How are clocks assembled?": "The tiny gears, springs, and the clock face are all carefully put together inside a case. Then the hands are attached.",
  "How are erasers put on pencils?": "A small, round eraser is pushed onto a metal band called a ferrule, which is then crimped onto the end of the pencil.",
  "How are marbles made?": "They are made by melting glass and then rolling and cooling it into perfect little spheres with beautiful colored patterns inside.",
  "How are kites built?": "Light sticks (like bamboo or plastic) are tied together to make a frame. Then, paper or thin plastic is stretched over it and tied to a string.",
  "What is maths?": "Maths is all about numbers, shapes, and patterns! It helps us count, measure, and solve puzzles.",
  "Why do we need to learn maths?": "We use maths every day! To count toys, share sweets fairly, tell the time, and even when we play games.",
  "What are numbers?": "Numbers are symbols we use to count things. Like 1, 2, 3 for one apple, two apples, three apples!",
  "What is counting?": "Counting is saying numbers in order to find out how many of something there are.",
  "What is addition?": "Addition is putting numbers together to find the total. Like if you have 2 chocolates and get 1 more, you have 3!",
  "What is subtraction?": "Subtraction is taking away one number from another. Like if you have 4 candies and eat 1, you have 3 left.",
  "What is a plus sign?": "The plus sign '+' means to add or put together.",
  "What is a minus sign?": "The minus sign '-' means to subtract or take away.",
  "What is an equal sign?": "The equal sign '=' means 'is the same as'. So 2+2=4 means two plus two is the same as four.",
  "What are shapes?": "Shapes are the forms of things around us, like circles, squares, triangles, and rectangles.",
  "What is a circle?": "A circle is a round shape with no corners, like a pizza or a clock.",
  "What is a square?": "A square is a shape with four equal sides and four corners, like a window or a chess board square.",
  "What is a triangle?": "A triangle is a shape with three sides and three corners, like a slice of pizza or a road sign.",
  "What is a rectangle?": "A rectangle is a shape with four sides and four corners, but its opposite sides are equal. Like a door or a book.",
  "What is bigger and smaller?": "Bigger means larger in size, and smaller means lesser in size. A football is bigger than a tennis ball.",
  "What is more and less?": "More means a greater amount, and less means a smaller amount. 10 is more than 5.",
  "What is tall and short?": "Tall means having a great height, and short means having a little height. A giraffe is tall, a rabbit is short.",
  "What is heavy and light?": "Heavy means something has a lot of weight, and light means it has little weight. A rock is heavy, a feather is light.",
  "What is long and short?": "Long means a great length, and short means a small length. A train is long, a pencil is short.",
  "What is a pattern?": "A pattern is when colors, shapes, or numbers repeat in a certain order, like red, blue, red, blue.",
  "How do we measure things?": "We measure things using tools like a ruler for length, a weighing scale for weight, and a clock for time.",
  "What is a ruler for?": "A ruler is used to measure how long or short something is, in centimeters or inches.",
  "What is time?": "Time helps us know when to wake up, eat, play, and sleep. We see time on clocks and watches.",
  "What is a clock?": "A clock is a tool that shows us what time it is. It has numbers and moving hands.",
  "How do we read a clock?": "The short hand tells us the hour, and the long hand tells us the minutes.",
  "What is money?": "Money is what we use to buy things like toys, food, and books. Coins and notes are types of money.",
  "How do we count money?": "We add the values of coins and notes together. Like one 10-rupee note and one 5-rupee coin make 15 rupees.",
  "What is sharing?": "Sharing is dividing things equally among friends. If you have 6 sweets and 3 friends, everyone gets 2 sweets.",
  "What is half?": "Half means one of two equal parts. If you break a chocolate bar into two equal pieces, each piece is a half.",
  "What is a double?": "Double means two times the amount. The double of 3 is 6.",
  "What is a graph?": "A graph is a picture that uses bars or lines to show numbers and help us compare things easily.",
  "What is a calendar?": "A calendar shows us the days, weeks, and months of a year. It helps us know the date.",
  "How many days are in a week?": "There are 7 days in a week: Sunday, Monday, Tuesday, Wednesday, Thursday, Friday, Saturday.",
  "How many months are in a year?": "There are 12 months in a year, like January, February, March, and so on.",
  "What is a number line?": "A number line is a straight line with numbers placed in order. It helps us with counting and adding.",
  "What is even and odd?": "Even numbers can be divided into two equal groups (like 2, 4, 6). Odd numbers cannot (like 1, 3, 5).",
  "What is a fraction?": "A fraction is a part of a whole. Like if you have a pizza cut into 4 slices, one slice is one-fourth.",
  "What is symmetry?": "Symmetry is when one half of something is a mirror image of the other half, like a butterfly's wings.",
  "What is sorting?": "Sorting is arranging things into groups based on how they are alike, like sorting toys by color.",
  "What is estimating?": "Estimating is making a smart guess about how many or how much, without counting exactly.",
  "What is a puzzle?": "A puzzle is a problem or a game that makes you think to find the answer, like a jigsaw or a riddle.",
  "What is a dice?": "A dice is a small cube with dots on each side, used in games to give a random number from 1 to 6.",
  "What is a tally mark?": "Tally marks are a quick way of counting. We write four lines and then a diagonal line across them for five.",
  "What is a clock's second hand?": "The thin, fast-moving hand on a clock that counts the seconds.",
  "What is a month?": "A month is a period of about 4 weeks. There are 12 months in a year.",
  "What is a year?": "A year is the time it takes for the Earth to go around the sun once. It has 365 days.",
  "What is a decade?": "A decade is a period of 10 years.",
  "What is a century?": "A century is a period of 100 years.",
  "What is a millennium?": "A millennium is a period of 1000 years.",
  "What is a dozen?": "A dozen means 12 of something, like a dozen eggs.",
  "What is a pair?": "A pair means two things that go together, like a pair of shoes or a pair of socks.",
  "What is a zero?": "Zero means nothing. It shows that there is no amount. If you have no apples, you have zero apples.",
  "What is a digit?": "A digit is a single symbol used to make numbers. The digits are 0, 1, 2, 3, 4, 5, 6, 7, 8, 9.",
  "What is a number?": "A number is made up of one or more digits and tells us 'how many'.",
  "What is a sum?": "A sum is the answer you get when you add two or more numbers together.",
  "What is a difference?": "The difference is the answer you get when you subtract one number from another.",
  "What is multiplication?": "Multiplication is a fast way of adding the same number many times. Like 3 times 4 is the same as 4+4+4.",
  "What is division?": "Division is sharing or grouping a number into equal parts. Like 10 sweets shared by 2 friends is 5 each.",
  "What is a multiplication sign?": "The multiplication sign is 'x'. It means 'groups of'. 3 x 2 means three groups of two.",
  "What is a division sign?": "The division sign is ''. It means to share or split into equal groups.",
  "What is a clock's minute hand?": "The longer hand on a clock that tells us how many minutes have passed in the hour.",
  "What is a clock's hour hand?": "The shorter hand on a clock that tells us which hour it is.",
  "What is a.m.?": "a.m. is the time from midnight to noon. The morning time.",
  "What is p.m.?": "p.m. is the time from noon to midnight. The afternoon and night time.",
  "What is a calendar year?": "A calendar year starts on January 1st and ends on December 31st.",
  "What is a leap year?": "A leap year has one extra day in February, making it 366 days long. It happens every four years.",
  "What is a clock's face?": "The front part of the clock that has the numbers and hands on it.",
  "What is a digital clock?": "A clock that shows the time with numbers, like 3:45, instead of hands.",
  "What is an analog clock?": "A clock that shows the time with moving hands on a dial with numbers.",
  "What is a clock's dial?": "The face of an analog clock where the numbers are written.",
  "What is a clock's numbers?": "The numbers 1 to 12 on a clock face that show the hours.",
  "What is art?": "Art is a fun way of expressing your feelings and ideas using colors, shapes, sounds, or movements!",
  "Why is art important?": "Art lets us be creative, shows our imagination, and makes the world a more beautiful and interesting place.",
  "What are colors?": "Colors are what we see when light bounces off things. Like red, blue, yellow, green!",
  "What is a primary color?": "Primary colors are the most important colors: Red, Yellow, and Blue. We can mix them to make all other colors.",
  "How do we make new colors?": "By mixing primary colors! Red and yellow make orange. Blue and yellow make green. Red and blue make purple.",
  "What is drawing?": "Drawing is making pictures on paper using pencils, crayons, or markers.",
  "What is painting?": "Painting is using brushes and colorful paints to create beautiful pictures.",
  "What is a brush?": "A brush is a tool with soft hairs on one end, used to put paint on paper or canvas.",
  "What is a canvas?": "A canvas is a strong cloth that artists paint on.",
  "What is clay?": "Clay is soft, muddy earth that you can shape into pots, animals, or anything you like! It hardens when it dries.",
  "What is sculpture?": "Sculpture is making art that you can see from all sides, like a statue, by carving, modeling, or building.",
  "What is music?": "Music is the art of making sounds that are beautiful to listen to, using your voice or instruments.",
  "What is a song?": "A song is a piece of music where someone sings words.",
  "What is singing?": "Singing is using your voice to make musical sounds and tunes.",
  "What is a musical instrument?": "A musical instrument is something you use to make music, like a piano, guitar, flute, or drums.",
  "What is dance?": "Dance is moving your body to music in a way that expresses feelings or tells a story.",
  "Why do people dance?": "People dance to have fun, to celebrate, to express joy, or just because they love the music!",
  "What is a story?": "A story is a tale about people, animals, or imaginary characters and the things that happen to them.",
  "What is acting?": "Acting is pretending to be someone else, like a character in a story, in a play or a movie.",
  "What is a play?": "A play is a story that is acted out on a stage by actors.",
  "What is a stage?": "A stage is a raised platform where actors, dancers, or musicians perform for an audience.",
  "What is an audience?": "An audience is a group of people who watch and listen to a performance, like a play or a concert.",
  "What is a drawing pencil?": "A pencil used for drawing. It can be dark (like a B pencil) or light (like an H pencil).",
  "What is a crayon?": "A crayon is a stick of colored wax used for drawing and coloring.",
  "What is a sketch?": "A sketch is a quick, simple drawing that doesn't have many details.",
  "What is a portrait?": "A portrait is a drawing, painting, or photo of a person.",
  "What is a landscape?": "A landscape is a drawing or painting of nature, like mountains, trees, and rivers.",
  "What is a still life?": "A still life is a drawing or painting of objects that don't move, like fruits, flowers, or bottles.",
  "What is origami?": "Origami is the Japanese art of folding paper into beautiful shapes, like animals and flowers.",
  "What is collage?": "Collage is making a picture by sticking different things like paper, cloth, or photographs onto a surface.",
  "What is craft?": "Craft is making useful or decorative things by hand, like greeting cards, jewelry, or decorations.",
  "What is a rhythm?": "Rhythm is a pattern of beats in music that makes you want to tap your foot or clap your hands.",
  "What is a melody?": "A melody is a tune, or a series of musical notes that are pleasing to hear.",
  "What is a drum?": "A drum is a musical instrument that you play by hitting it with your hands or sticks.",
  "What is a flute?": "A flute is a musical instrument that you play by blowing air across a hole.",
  "What is a guitar?": "A guitar is a musical instrument with strings that you play by plucking or strumming the strings.",
  "What is a piano?": "A piano is a large musical instrument with black and white keys that you press to make sounds.",
  "What is a violin?": "A violin is a musical instrument with strings that you play by moving a bow across the strings.",
  "What is a band?": "A band is a group of people who play different musical instruments together.",
  "What is an orchestra?": "An orchestra is a large group of musicians who play together, often classical music, with many different instruments.",
  "What is a concert?": "A concert is a live performance of music for an audience.",
  "What is a folk dance?": "A folk dance is a traditional dance from a particular country or region, passed down through generations.",
  "What is a ballet?": "Ballet is a type of dance that tells a story through movement, with graceful and precise steps, often performed on toes.",
  "What is a puppet?": "A puppet is a doll that you can move by putting your hand inside it or by using strings. It's used in puppet shows.",
  "What is a puppet show?": "A show where a storyteller uses puppets to act out a story.",
  "What is a mask?": "A mask is a covering for all or part of the face, used for protection, disguise, or entertainment.",
  "What is a costume?": "Clothes that an actor or dancer wears to look like a particular character.",
  "What is a set in a play?": "The set is all the scenery, furniture, and props on a stage that create the place where the story happens.",
  "What is a prop?": "A prop is an object that an actor uses during a play, like a book, a sword, or a telephone.",
  "What is a script?": "A script is the written text of a play, film, or show. It tells the actors what to say and do.",
  "What is a character?": "A character is a person, animal, or being in a story, play, or movie.",
  "What is a plot?": "The plot is the main events that happen in a story.",
  "What is a poet?": "A poet is a person who writes poems.",
  "What is a poem?": "A poem is a piece of writing that uses beautiful and imaginative language, often with a rhythm and sometimes rhyme.",
  "What is rhyme?": "Rhyme is when words have the same ending sound, like 'cat' and 'hat', or 'sing' and 'ring'.",
  "What is a storybook?": "A book that contains a story, usually with pictures.",
  "What is an illustrator?": "An illustrator is an artist who draws the pictures for books.",
  "What is a museum?": "A museum is a building where interesting and important objects, like works of art or historical items, are kept and shown to the public.",
  "What is an art gallery?": "A building or room where works of art are shown for people to see.",
  "What is a potter?": "A potter is an artist who makes pots, bowls, and other items out of clay.",
  "What is a potter's wheel?": "A spinning wheel that a potter uses to shape clay into round pots.",
  "What is a kiln?": "A kiln is a special very hot oven used to bake clay pots and sculptures to make them hard and strong.",
  "What is weaving?": "Weaving is making cloth or fabric by crossing threads over and under each other on a loom.",
  "What is a loom?": "A loom is a machine used for weaving thread into cloth.",
  "What is jewelry?": "Jewelry is decorative items people wear, like rings, necklaces, and bracelets.",
  "What is a bead?": "A small, decorative object with a hole through it, so it can be threaded with others to make jewelry.",
  "What is a pattern in art?": "A pattern is a design in which colors, lines, or shapes are repeated in a planned way.",
  "What is a mural?": "A mural is a large painting that is done directly on a wall or ceiling.",
  "What is a cartoon?": "A cartoon is a simple drawing that is often funny, or an animated movie.",
  "What is animation?": "Animation is the art of making cartoons move. It's done by showing many pictures, one after another, very quickly.",
  "What is a self-portrait?": "A portrait that an artist makes of themselves.",
  "What is abstract art?": "Abstract art uses shapes, colors, and forms to create an effect, but it does not look like a real person or thing.",
  "What is a color wheel?": "A color wheel is a circle that shows how colors are related to each other.",
  "What is a shade?": "A shade is a color that is made darker by adding black to it.",
  "What is a tint?": "A tint is a color that is made lighter by adding white to it.",
  "What is a line in art?": "A line is a long, thin mark that can be straight, curved, wavy, or any shape.",
  "What is a shape in art?": "A shape is a flat, closed area made when a line connects to itself, like a circle or a square.",
  "What is a form in art?": "A form is a shape that is three-dimensional, like a cube, sphere, or pyramid. It has height, width, and depth.",
  "What is texture in art?": "Texture is how the surface of something feels or looks like it feels, like rough, smooth, bumpy, or soft.",
  "What is space in art?": "Space is the area around, between, or within parts of an artwork.",
  "What is value in art?": "Value means how light or dark a color is.",
  "What is a masterpiece?": "A masterpiece is an outstanding piece of artwork, the very best work an artist has done."
}